# St7SetInterpolatedMultiPointLinkAttributes

Assigns attributes to an interpolated multi-point link.

long St7SetInterpolatedMultiPointLinkAttributes(long uID, long LinkNum,

long Couple)

Input Parameters

uID

Strand7 model file ID.

LinkNum

Link number.

Couple

One of cpTranslational, cpRotational or cpBoth.